using OpenQA.Selenium;
using OpenQA.Selenium.Chrome;
using SuperParser.DAL.Entities;
using System;
using System.Collections.Generic;
using System.Linq;

namespace SuperParser.BLL.Services
{
    public class SeleniumService
    {
        ChromeDriver _chrDriver;
        
        public void OpenSeleniumService()
        {
            try
            {
                ChromeDriverService service = ChromeDriverService.CreateDefaultService();
                service.HideCommandPromptWindow = true;
                _chrDriver = new ChromeDriver(service);
                _chrDriver.Manage().Timeouts().ImplicitWait = TimeSpan.FromSeconds(20);
                _chrDriver.Navigate().GoToUrl("https://mobile-business.by/user/login/");
            }
            catch (Exception)
            {
                _chrDriver.Quit();
            }
        }

        public (int index, IEnumerable<string> value) ParseSubcategory(string vacancyName, int index)
        {
            string[] bank =
            {
                "Кассир",
                "Менеджер",
                "Специалист",
                "Специалист по кредитованию",
                "Специалист по лизингу"
            };

            string[] bygal =
            {
                "Аналитик",
                "Аудитор",
                "Бухгалтер",
                "Бухгалтер 1С",
                "Бухгалтер-калькулятор",
                "Бухгалтер-экономист",
                "Главный бухгалтер",
                "Заместитель главного бухгалтера",
                "Инспектор",
                "Консультант по бухгалтерскому учету",
                "Менеджер",
                "Помощник бухгалтера",
                "Специалист",
                "Финансовый аналитик",
                "Финансовый менеджер",
                "Экономист"
            };

            string[] vremrab =
            {
                "Агент по продажам",
                "Администратор",
                "Грузчик",
                "Консультант",
                "Менеджер",
                "Работа без специальной подготовки",
                "Специалист по продажам",
                "Укладчик",
                "Фотограф",
                "Швея"
            };

            string[] diz =
            {
                "Графический дизайнер",
                "Дизайнер",
                "Дизайнер интерьера",
                "Дизайнер-конструктор",
                "Ландшафтный дизайнер",
                "Модельер",
                "Оформитель",
                "Художник"
            };

            string[] homeperson =
            {
                "Воспитатель",
                "Горничная",
                "Домработница",
                "Няня",
                "Помощник по хозяйству",
                "Садовник",
                "Сиделка"
            };

            string[] ather =
            {
                "Агроном",
                "Администратор",
                "Горничная",
                "Грузчик-кладовщик",
                "Звукорежиссер",
                "Изготовитель полуфабрикатов",
                "Картонажник",
                "Кассир",
                "Кладовщик",
                "Комплектовщик",
                "Консультант",
                "Курьер",
                "Лаборант",
                "Лифтер",
                "Мастер маникюра и педикюра",
                "Мастер по ремонту сотовых телефонов",
                "Менеджер",
                "Менеджер по продвижению",
                "Механик",
                "Модель",
                "Монтажник",
                "Наладчик",
                "Няня",
                "Оператор",
                "Оператор call-центра",
                "Оценщик",
                "Помощник",
                "Помощник по хозяйству",
                "Портной",
                "Промоутер",
                "Рабочий по комплексному обслуживанию зданий и сооружений",
                "Расклейщик объявлений",
                "Сборщик",
                "Сборщик мебели",
                "Сиделка",
                "Специалист",
                "Специалист по продажам",
                "Специалист по работе с клиентами",
                "Специалист по сертификации",
                "Техник",
                "Тонировщик",
                "Торговый представитель",
                "Тренер",
                "Тренер-инструктор",
                "Уборка помещений",
                "Уборщица",
                "Укладчик-упаковщик",
                "Упаковщик",
                "Химик",
                "Швея",
                "Шеф-повар",
                "Шиномонтажник",
                "Эколог"
            };

            string[] izdat =
            {
                "Верстальщик",
                "Корректор",
                "Менеджер",
                "Менеджер по полиграфии",
                "Менеджер по работе с клиентами",
                "Оператор печати",
                "Оператор полиграфического оборудования",
                "Переплетчик",
                "Печатник",
                "Редактор",
                "Специалист",
                "Художник"
            };

            string[] inzener =
            {
                "Ведущий инженер",
                "Главный инженер",
                "Инженер",
                "Инженер-конструктор",
                "Инженер-механик",
                "Инженер по охране труда",
                "Инженер по техническому надзору",
                "Инженер-проектировщик",
                "Инженер-сметчик",
                "Инженер-технолог",
                "Инженер-электрик",
                "Инженер-энергетик",
                "Конструктор",
                "Мастер",
                "Механик",
                "Наладчик",
                "Начальник производства",
                "Проектировщик",
                "Специалист",
                "Теплотехник",
                "Техник",
                "Технолог"
            };

            string[] kyltyra =
            {
                "Event-менеджер",
                "Актер",
                "Аниматор",
                "Арт-директор",
                "Арт-менеджер",
                "Библиотекарь",
                "Ведущий",
                "Видеомонтажер",
                "Видеооператор",
                "Гардеробщик",
                "Инструктор групповых программ",
                "Кассир",
                "Менеджер",
                "Монтажер",
                "Оператор",
                "Официант",
                "Оформитель",
                "Педагог",
                "Преподаватель танцев",
                "Секретарь",
                "Специалист",
                "Танцовщица",
                "Фотограф",
                "Хореограф",
                "Художник"
            };

            string[] kyrers =
            {
                "Агент",
                "Агент по продажам",
                "Консультант",
                "Курьер",
                "Расклейщик объявлений",
                "Распространитель",
                "Специалист по продажам",
                "Торговый агент",
                "Торговый представитель"
            };

            string[] marketing =
            {
                "PR-менеджер",
                "Агент",
                "Администратор отдела маркетинга",
                "Аналитик",
                "Аналитик-консультант",
                "Бренд-менеджер",
                "Директор по маркетингу",
                "Интернет-маркетолог",
                "Консультант",
                "Копирайтер",
                "Макетчик",
                "Макетчик наружной рекламы",
                "Маркетолог",
                "Маркетолог-аналитик",
                "Менеджер",
                "Менеджер-маркетолог",
                "Менеджер по контекстной рекламе",
                "Менеджер по маркетингу",
                "Менеджер по привлечению",
                "Менеджер по продажам интернет-рекламы",
                "Менеджер по работе с клиентами",
                "Менеджер по развитию",
                "Менеджер по рекламе",
                "Мерчендайзер",
                "Представитель",
                "Промоутер",
                "Специалист",
                "Специалист отдела продаж",
                "Специалист по контекстной рекламе",
                "Специалист по маркетингу",
                "Специалист по продажам",
                "Специалист по продвижению",
                "Специалист по рекламе"
            };

            string[] medicina =
            {
                "Администратор",
                "Администратор call-центра",
                "Акушер",
                "Анестезиолог",
                "Ассистент",
                "Ассистент стоматолога",
                "Ветеринар",
                "Врач",
                "Врач лабораторной диагностики",
                "Гинеколог",
                "Главный врач",
                "Дерматолог",
                "Диетолог",
                "Зубной техник",
                "Инфекционист",
                "Кардиолог",
                "Косметолог",
                "Косметолог-дерматолог",
                "Массажист",
                "Медицинский представитель",
                "Медицинский работник",
                "Медработник",
                "Медсестра",
                "Менеджер",
                "Невролог",
                "Оператор call-центра",
                "Ортопед",
                "Офтальмолог",
                "Педиатр",
                "Провизор",
                "Провизор-фармацевт",
                "Психолог",
                "Пульмонолог",
                "Реаниматолог",
                "Регистратор",
                "Санитар",
                "Сиделка",
                "Специалист",
                "Стоматолог",
                "Стоматолог-ортопед",
                "Стоматолог-терапевт",
                "Стоматолог-хирург",
                "Терапевт",
                "Травматолог",
                "Фармацевт",
                "Фельдшер",
                "Фельдшер-лаборант",
                "Физиотерапевт",
                "Химик",
                "Хирург",
                "Эксперт",
                "Эндокринолог"
            };

            string[] education =
            {
                "Воспитатель",
                "Дефектолог",
                "Инструктор",
                "Инструктор по аэробике",
                "Инструктор по плаванию",
                "Менеджер по обучению",
                "Педагог",
                "Переводчик",
                "Помощник воспитателя",
                "Преподаватель",
                "Преподаватель иностранного языка",
                "Психолог",
                "Репетитор",
                "Специалист",
                "Тренер",
                "Тренер-консультант",
                "Учитель",
                "Хореограф"
            };

            string[] obslyzhivanie =
            {
                "Администратор",
                "Визажист",
                "Горничная",
                "Гувернантка",
                "Дворник",
                "Домработница",
                "Завхоз",
                "Закройщик",
                "Инженер по охране труда",
                "Инспектор",
                "Консультант",
                "Косметолог",
                "Массажист",
                "Мастер",
                "Мастер маникюра",
                "Мастер маникюра педикюра",
                "Мастер наращивания ногтей",
                "Мастер обувного производства",
                "Менеджер",
                "Менеджер-консультант",
                "Менеджер по работе с клиентами",
                "Механик",
                "Мойщик",
                "Мойщик автомобилей",
                "Монтажник",
                "Няня",
                "Обувщик",
                "Оператор",
                "Парикмахер",
                "Помощник",
                "Помощник по хозяйству",
                "Портной",
                "Приемщик",
                "Продавец-консультант",
                "Работники сферы услуг",
                "Сантехник",
                "Сиделка",
                "Сотрудник",
                "Стилист",
                "Уборка помещений",
                "Уборщица",
                "Фотограф",
                "Швейцар",
                "Швея"
            };

            string[] office =
            {
                "Администратор офиса",
                "Архивариус",
                "Ассистент",
                "Диспетчер",
                "Менеджер",
                "Менеджер интернет-магазина",
                "Менеджер по работе с клиентами",
                "Оператор",
                "Оператор колл-центра",
                "Офис-менеджер",
                "Переводчик",
                "Помощник",
                "Помощник директора",
                "Помощник руководителя",
                "Референт",
                "Секретарь",
                "Секретарь-референт",
                "Сотрудник",
                "Специалист",
                "Специалист по продажам",
                "Специалист по работе с клиентами"
            };

            string[] hunter =
            {
                    "Егерь",
                    "Охотовед"
            };

            string[] security =
            {
                "Заместитель службы безопасности",
                "Инспектор",
                "Контролер",
                "Контролер охраны",
                "Милиционер",
                "Начальник службы безопасности",
                "Оператор видеонаблюдения",
                "Охранник",
                "Специалист"
            };

            string[] it =
            {
                "Android Developer",
                "ASP.NET Developer",
                "HTML-верстальщик",
                "IOS Developer",
                "IT-специалист",
                "Java Developer",
                "NET Developer",
                "PHP Developer",
                "SEO-специалист",
                "Web-программист",
                "Web-разработчик",
                "Администратор",
                "Администратор сайта",
                "Аналитик",
                "Веб-мастер",
                "Верстальщик",
                "Дизайнер",
                "Инженер-программист",
                "Интернет-маркетолог",
                "Контент-менеджер",
                "Менеджер",
                "Менеджер интернет-магазина",
                "Оператор",
                "Оператор ПК",
                "Помощник SEO-специалиста",
                "Программист",
                "Программист 1С",
                "Программист Java",
                "Программист NET",
                "Программист PHP",
                "Разработчик мобильных приложений",
                "Системный администратор",
                "Специалист",
                "Специалист по SEO",
                "Специалист по контекстной рекламе",
                "Специалист по обслуживанию",
                "Специалист по продажам",
                "Тестировщик"
            };

            string[] rabotastudents =
            {
                "Менеджер",
                "Менеджер по продажам",
                "Мерчендайзер",
                "Оператор",
                "Оператор call-центра",
                "Оператор ПК",
                "Помощник",
                "Промоутер",
                "Расклейщик объявлений",
                "Репетитор"
            };

            string[] rabspecial =
            {
                "Аппаратчик",
                "Грузчик",
                "Дорожный рабочий",
                "Жестянщик",
                "Кладовщик",
                "Комплектовщик",
                "Консультант",
                "Контролер",
                "Лифтер",
                "Маляр",
                "Мастер",
                "Мастер смены",
                "Машинист",
                "Механизатор",
                "Механик",
                "Мойщик",
                "Мойщик автомобилей",
                "Мойщик посуды",
                "Монтажник",
                "Монтер",
                "Наладчик",
                "Отделочник",
                "Пекарь",
                "Переплетчик",
                "Плиточник",
                "Плотник",
                "Помощник",
                "Портной",
                "Работник склада",
                "Рабочий",
                "Рабочий на производство",
                "Разнорабочий",
                "Резчик",
                "Сантехник",
                "Сборщик",
                "Сборщик мебели",
                "Сварщик",
                "Слесарь",
                "Слесарь по ремонту",
                "Слесарь-сантехник",
                "Специалист",
                "Станочник",
                "Столяр",
                "Сторож",
                "Строитель",
                "Стропальщик",
                "Тампопечаник",
                "Техник",
                "Токарь",
                "Тракторист",
                "Уборка помещений",
                "Уборщица",
                "Уборщица-посудомойщица",
                "Укладчик",
                "Укладчик-упаковщик",
                "Упаковщик",
                "Формовщик",
                "Фрезеровщик",
                "Швея",
                "Шиномонтажник",
                "Штукатур",
                "Электрик",
                "Электромеханик",
                "Электромонтажник",
                "Электромонтер",
                "Электросварщик"
            };

            string[] topmanager =
            {
                "Директор",
                "Директор по строительству",
                "Директор производства",
                "Заместитель",
                "Заместитель генерального директора",
                "Заместитель директора",
                "Коммерческий директор",
                "Менеджер",
                "Начальник",
                "Начальник отдела",
                "Начальник отдела продаж",
                "Начальник производства",
                "Начальник финансового управления",
                "Региональный управляющий",
                "Руководитель",
                "Руководитель отдела",
                "Руководитель проекта",
                "Управляющий"
            };

            string[] smi =
            {
                "Главный редактор",
                "Диктор",
                "Журналист",
                "Контент-менеджер"
            };

            string[] straxovanie =
            {
                "Консультант по страхованию",
                "Специалист",
                "Страховой агент"
            };

            string[] bilding =
            {
                "Агент",
                "Агент по недвижимости",
                "Архитектор",
                "Бетонщик",
                "Газоэлектросварщик",
                "Геодезист",
                "Дизайнер",
                "Дорожный рабочий",
                "Замерщик",
                "Инженер-конструктор",
                "Инженер-проектировщик",
                "Инженер-сметчик",
                "Инженер-строитель",
                "Кабельщик",
                "Каменщик",
                "Конструктор",
                "Крановщик",
                "Кровельщик",
                "Маляр",
                "Мастер",
                "Менеджер",
                "Менеджер по коммерческой недвижимости",
                "Менеджер по недвижимости",
                "Монолитчик",
                "Монтажник",
                "Монтер",
                "Начальник участка",
                "Отделочник",
                "Оценщик",
                "Плиточник",
                "Подсобный рабочий",
                "Проектировщик",
                "Промышленный альпинист",
                "Прораб",
                "Рабочий строитель",
                "Разнорабочий",
                "Реставратор",
                "Риэлтор",
                "Риэлтор по жилой недвижимости",
                "Сметчик",
                "Специалист",
                "Специалист по продажам",
                "Строитель",
                "Ученик",
                "Фасадчик",
                "Штукатур",
                "Электрик",
                "Электромонтажник",
                "Электросварщик",
                "Электрослесарь"
            };

            string[] torgovla =
            {
                "Агент",
                "Агент по продажам",
                "Администратор магазина",
                "Администратор торгового зала",
                "Заведующий магазином",
                "Кассир",
                "Кассир-контролер",
                "Кладовщик",
                "Комплектовщик",
                "Консультант",
                "Контролер",
                "Менеджер",
                "Менеджер интернет-магазина",
                "Менеджер по продажам",
                "Менеджер по продажам интернет-рекламы",
                "Менеджер по работе с клиентами",
                "Мерчендайзер",
                "Начальник отдела закупок",
                "Начальник отдела продаж",
                "Оператор",
                "Представитель",
                "Продавец",
                "Продавец автозапчастей",
                "Продавец-кассир",
                "Продавец-консультант",
                "Снабженец",
                "Специалист",
                "Специалист отдела продаж",
                "Специалист по ВЭД",
                "Специалист по продажам",
                "Специалист по работе с клиентами",
                "Старший кассир",
                "Товаровед",
                "Торговый агент",
                "Торговый представитель",
                "Торговый региональный представитель",
                "Флорист"
            };

            string[] transport =
            {
                "Автослесарь",
                "Автоэлектрик",
                "Ведущий специалист",
                "Водитель",
                "Водитель категории B",
                "Водитель категории CE",
                "Водитель категории D",
                "Водитель категории DE",
                "Водитель категории С",
                "Водитель категорий BC",
                "Водитель-курьер",
                "Водитель-международник",
                "Водитель-монтажник",
                "Водитель с личным авто",
                "Водитель-эвакуатора",
                "Водитель-экспедитор",
                "Диспетчер",
                "Логист",
                "Логист-экспедитор",
                "Мастер",
                "Машинист",
                "Менеджер",
                "Менеджер по логистике",
                "Менеджер по перевозкам",
                "Менеджер по продажам",
                "Механизатор",
                "Мойщик автомобилей",
                "Моторист",
                "Начальник",
                "Оператор call-центра",
                "Продавец автозапчастей",
                "Работник склада",
                "Регулировщик",
                "Специалист",
                "Специалист по логистике",
                "Специалист по перевозкам",
                "Специалист по продажам",
                "Специалист по шиномонтажу",
                "Тракторист",
                "Шиномонтажник",
                "Экспедитор"
            };

            string[] tyrizm =
            {
                "Администратор",
                "Бариста",
                "Бармен",
                "Бармен-бариста",
                "Гардеробщик",
                "Заведующий производством",
                "Кассир",
                "Кондитер",
                "Кулинар",
                "Кухонный рабочий",
                "Менеджер",
                "Менеджер по туризму",
                "Мойщик посуды",
                "Обвальщик мяса",
                "Официант",
                "Пекарь",
                "Пекарь-кондитер",
                "Пиццер",
                "Повар",
                "Повар-пиццер",
                "Повар-сушист",
                "Посудомойщик",
                "Специалист",
                "Специалист по продажам",
                "Управляющий",
                "Хостес",
                "Шеф",
                "Шеф-повар"
            };

            string[] ypravpersonal =
            {
                "Заместитель отдела кадров",
                "Менеджер по персоналу",
                "Начальник отдела кадров",
                "Рекрутер",
                "Специалист по персоналу"
            };

            string[] sport =
            {
                "Инструктор в фитнес-центре",
                "Тренер"
            };

            string[] notariys =
            {
                "Инспектор",
                "Помощник юриста",
                "Специалист по кадровому делопроизводству",
                "Специалист по оформлению документации",
                "Юрисконсульт",
                "Юрист"
            };

            var subDict = new Dictionary<int, string[]>
            {
                {20, bank},
                {21, bygal},
                {22, vremrab},
                {23, diz},
                {24, homeperson},
                {25, ather},
                {26, izdat},
                {27, inzener},
                {29, kyltyra},
                {30, kyrers},
                {31, marketing},
                {32, medicina},
                {33, education},
                {34, obslyzhivanie},
                {35, office},
                {36, hunter},
                {37, security},
                {19, it},
                {38, rabotastudents},
                {39, rabspecial},
                {40, topmanager},
                {41, smi},
                {42, straxovanie},
                {43, bilding},
                {44, torgovla},
                {45, transport},
                {46, tyrizm},
                {47, ypravpersonal},
                {48, sport},
                {49, notariys}
            };

            var splitedName = vacancyName.Split(new[] { ' ' }, StringSplitOptions.RemoveEmptyEntries);

            var valuesDict = new Dictionary<int, IEnumerable<string>>();
            foreach (var item in subDict)
            {
                var subCategory = item.Value.Intersect(splitedName, StringComparer.OrdinalIgnoreCase);
                if (subCategory.Any())
                    valuesDict.Add(item.Key, subCategory);
            }     

            if (valuesDict.Count == 0)
            {
                var splitedName2 = vacancyName.Split(new[] { ' ','-','/' }, StringSplitOptions.RemoveEmptyEntries);
                foreach (var item in subDict)
                {
                    var subCategory = item.Value.Intersect(splitedName2, StringComparer.OrdinalIgnoreCase);
                    if (subCategory.Any())
                        valuesDict.Add(item.Key, subCategory);
                }
            }

            if (valuesDict.Count == 0)
                throw new Exception();

            if (valuesDict.TryGetValue(index, out var result))
                return (index, result);

            var kvp = valuesDict.First();
            return (kvp.Key, kvp.Value);
        }

        public void CreateVacancies(List<Vacancy> vacancies, string index, string typecontact, string contact)
        {
            foreach (var v in vacancies)
            {
                _chrDriver.FindElement(By.XPath("//input[@id='id_title']")).SendKeys(v.Name);

                _chrDriver.FindElement(By.XPath("//select[@id='id_city']")).Click();
                try
                {
                     _chrDriver.FindElement(By.XPath($"//option[text()='{v.Address?.City?? (v.Area.name.Trim(' '))?? "Минск"}']")).Click();

                }
                catch (Exception)
                {
                    _chrDriver.FindElement(By.XPath($"//option[text()='Минск']")).Click();

                }

                _chrDriver.FindElement(By.XPath("//input[@id='id_employment']")).SendKeys($"{v.Schedule.Name}, {v.Employment.Name.ToLower()}");

                _chrDriver.FindElement(By.XPath("//input[@id='id_payment']")).SendKeys(v.Salary?.From?.ToString() ?? v.Salary?.To?.ToString()?? string.Empty);
                _chrDriver.FindElement(By.XPath("//input[@id='id_experience']")).SendKeys(v.Experience.Name);


                _chrDriver.FindElement(By.XPath("//textarea[@id='id_requirements']")).SendKeys(v.Requirements);
                _chrDriver.FindElement(By.XPath("//textarea[@id='id_duties']")).SendKeys(v.Responsebilities);
                
                if (v.Offers==" ")
                _chrDriver.FindElement(By.XPath("//textarea[@id='id_conditions']")).SendKeys("-");
                else _chrDriver.FindElement(By.XPath("//textarea[@id='id_conditions']")).SendKeys(v.Offers);

               


                _chrDriver.FindElement(By.XPath("//input[@id='id_education']")).SendKeys("Высшее, среднеспециальное");
                _chrDriver.FindElement(By.XPath("//input[@id='id_moderate']")).Click();

                try
                {
                    var result = ParseSubcategory(v.Name, Int32.Parse(index));
                    _chrDriver.FindElement(By.XPath($"//input[@value='11{result.index}']")).Click();
                    _chrDriver.FindElement(By.XPath($"//input[@value='11{result.index}']/preceding-sibling::a[1]")).Click();
                    _chrDriver.FindElement(By.XPath($"//input[@value='11{result.index}']/parent::span/following-sibling::ul/li/span/label[text()='{string.Join(" or ", result.value)}']/preceding-sibling::input")).Click();
                }
                catch (Exception)
                {
                       _chrDriver.FindElement(By.XPath($"//input[@value='1125']")).Click();
                       _chrDriver.FindElement(By.XPath($"//input[@value='1125']/preceding-sibling::a[1]")).Click();
                       _chrDriver.FindElement(By.XPath($"//input[@value='1125']/parent::span/following-sibling::ul/li/span/label[text()='Специалист']/preceding-sibling::input")).Click();
                }

                _chrDriver.FindElement(By.XPath("//select[@id='id_contacts-0-type']")).Click();
                _chrDriver.FindElement(By.XPath($"//option[text()='{typecontact}']")).Click();
                _chrDriver.FindElement(By.XPath("//input[@id='id_contacts-0-data']")).SendKeys(contact);
                _chrDriver.FindElement(By.XPath("//input[@name='_save']")).Click();

               _chrDriver.FindElement(By.XPath("//a[@class='addlink']")).Click();
            }
                _chrDriver.Quit();
        }

        public void Login(string log, string pass)
        {
            if (log == null || pass == null)
            {
                 _chrDriver.FindElement(By.XPath("//input[@id='id_username']")).SendKeys("mbadmin");
                 _chrDriver.FindElement(By.XPath("//input[@id='id_password']")).SendKeys("9148rt273198xz769");

            }
            else
            {
                   _chrDriver.FindElement(By.XPath("//input[@id='id_username']")).SendKeys(log);
                   _chrDriver.FindElement(By.XPath("//input[@id='id_password']")).SendKeys(pass);
            }
            _chrDriver.FindElement(By.XPath("//input[@value='Войти']")).Click(); 
        }

        public void OpenVacancyAdminPanel()
        {
            _chrDriver.FindElement(By.XPath("//a[text()='Личный кабинет']")).Click(); 
            _chrDriver.FindElement(By.XPath("//a[text()='Вакансии']")).Click(); 
            _chrDriver.FindElement(By.XPath("//a[@class='addlink']")).Click(); 
        }

        public void SetCompany(string companyId)
        {
            _chrDriver.FindElement(By.XPath("//input[@id='id_user_firm']")).SendKeys(companyId);
            _chrDriver.FindElement(By.XPath("//button[@type='submit']")).Click(); 
        }
    }
}
